{
    "heroList": [{
            "genre": "0",
            "no": "99",
            "name": "罗贯中",
            "name1": "字贯中",
            "doc": "罗贯中，名本，字贯中，号湖海散人，元末明初小说家，《三国志通俗演义》的作者"
        }, {
            "genre": "1",
            "no": "100",
            "name": "曹操",
            "name1": "字孟德",
            "doc": "魏武帝曹操，字孟德，小名阿瞒、吉利，沛国谯县（今安徽省亳州市）人。中国古代杰出的政治家、军事家、文学家、书法家、诗人。"
        }, {
            "genre": "1",
            "no": "101",
            "name": "刘备",
            "name1": "字玄德",
            "doc": "汉昭烈帝刘备，汉族，字玄德，涿郡涿县（今河北省涿州市）人，西汉中山靖王刘胜之后，蜀汉开国皇帝、政治家。史家多称其为先主。"
        }, {
            "genre": "1",
            "no": "102",
            "name": "孙权",
            "name1": "字仲谋",
            "doc": "孙权，字仲谋，谥号大皇帝（吴大帝），庙号太祖。吴郡富春县（今浙江省杭州市富阳区）人。三国时期孙吴的建立者（229年－252年5月21日在位）"
        }, {
            "genre": "2",
            "no": "200",
            "name": "张飞",
            "name1": "字翼德",
            "doc": "张飞，字翼德，涿郡（今河北保定涿州市）人，三国时期蜀汉名将。张飞勇武过人，与结拜兄弟关羽并称为“万人敌”。"
        }, {
            "genre": "2",
            "no": "201",
            "name": "关羽",
            "name1": "字云长",
            "doc": "关羽，字云长，小字长生，河东郡解县（今山西省运城市盐湖区解州镇）人。汉末三国时期名将。早年犯事，流落到涿郡，和刘备、张飞情同兄弟。参与镇压黄巾起义，跟随刘备颠沛流离。雄壮威猛，号称“万人敌”、雅号“美髯公”。"
        }, {
            "genre": "2",
            "no": "202",
            "name": "赵云",
            "name1": "字子龙",
            "doc": "赵云，字子龙，常山真定人。身长八尺，姿颜雄伟，三国时期蜀汉名将。汉末军阀混战，赵云受本郡推举，率领义从加入公孙瓒。期间结识了汉室皇亲刘备，但不久之后，赵云因为兄长去世而离开。"
        }, {
            "genre": "2",
            "no": "203",
            "name": "黄忠",
            "name1": "字汉升",
            "doc": "黄忠，字汉升，南阳（今河南南阳）人。汉末三国时期蜀汉名将。 本为刘表部下中郎将，后归刘备，并助刘备攻破益州刘璋。"
        }, {
            "genre": "2",
            "no": "204",
            "name": "马超",
            "name1": "字孟起",
            "doc": "马超，字孟起，扶风茂陵（今陕西兴平）人，汉伏波将军马援的后人，马腾的儿子，少年成名，曹操曾多次征召马超入京为官，但都被马超拒绝。而后马腾入京被封为卫尉，马超就统领了马腾的部队。"
        },
        {
            "genre": "2",
            "no": "205",
            "name": "诸葛亮",
            "name1": "字孔明",
            "doc": "诸葛亮，字孔明，号卧龙，琅琊阳都（今山东省沂南县）人 ，三国时期蜀汉丞相，中国古代杰出的政治家、军事家、文学家、发明家。"
        }, {
            "genre": "2",
            "no": "206",
            "name": "吕布",
            "name1": "字奉先",
            "doc": "吕布，字奉先，并州五原郡九原县人。东汉末年群雄之一。因为骁武被并州牧丁原授骑都尉、河内主簿等职。"
        }, {
            "genre": "2",
            "no": "207",
            "name": "典韦",
            "name1": "未知",
            "doc": "典韦，陈留己吾（今河南商丘市宁陵县己吾城村）人。东汉末年名将。相貌魁梧，膂力过人。本属张邈，曾单手举起牙门旗。"
        }, {
            "genre": "2",
            "no": "208",
            "name": "许诸",
            "name1": "字仲康",
            "doc": "许褚（chǔ），字仲康，谯郡谯县（今安徽亳州市古城镇）人。东汉末年曹操部下猛将。容貌雄毅，勇力绝人。早年聚亲朋数千户共同抵御贼寇。后来，率众归顺曹操。负责曹操的护卫工作，累迁武卫中郎将，赐号“虎侯”。"
        }, {
            "genre": "2",
            "no": "209",
            "name": "庞德",
            "name1": "字令明",
            "doc": "庞德，字令明，南安郡狟道县（今甘肃省武山县）人，原为马腾麾下武将，在随马腾四处征战的过程中屡立战功，勇冠三军。"
        }, {
            "genre": "2",
            "no": "210",
            "name": "孙策",
            "name1": "字伯符",
            "doc": "孙策，字伯符，吴郡富春（今浙江省杭州市富阳区）人。破虏将军孙坚长子、吴大帝孙权长兄。东汉末年割据江东一带的军阀，汉末群雄之一，孙吴政权的奠基者之一。《三国演义》称其武勇犹如霸王项羽，绰号“小霸王”。"
        }, {
            "genre": "3",
            "no": "300",
            "name": "张辽",
            "name1": "字文远",
            "doc": "张辽，字文远，雁门马邑（今山西省朔州市）人。汉末三国时期曹魏名将，聂壹的后人。起初，担任雁门郡吏。又先后跟随丁原、何进、董卓、吕布，恪尽职守，历尽坎坷。"
        }, {
            "genre": "3",
            "no": "301",
            "name": "张郃",
            "name1": "字儁乂",
            "doc": "张郃，字儁乂，河间郡鄚县（今河北省任丘市）人。汉末三国时期魏国名将。早年参与镇压黄巾起义。归属袁绍后，击破公孙瓒有功，迁宁国中郎将。参加官渡之战，被曹洪击退，随后投降曹操，授偏将军。"
        }, {
            "genre": "3",
            "no": "302",
            "name": "乐进",
            "name1": "字文谦",
            "doc": "乐进，字文谦，阳平郡卫侯国（今河南清丰）人。东汉末年名将。以其胆烈而成为曹操帐下吏，南征北讨。攻获嘉，斩俘数千。在官渡之战时，斩袁绍部将淳于琼。又从击袁谭、袁尚于黎阳，斩其大将严敬。又大破黄巾、雍奴、管承。"
        }, {
            "genre": "3",
            "no": "303",
            "name": "于禁",
            "name1": "字文则",
            "doc": "于禁，字文则，泰山郡钜平县（今山东省泰安市大汶口 ）人。汉末三国时期曹魏名将。先属鲍信（曹操的恩人），后属曹操。南征北战，立下了赫赫战功。敢于攻击不守军纪的青州兵，为了维护军法不惜杀掉自己的故友，受到曹操称赞“胜过古代名将”。"
        }, {
            "genre": "3",
            "no": "304",
            "name": "徐晃",
            "name1": "字公明",
            "doc": "徐晃，字公明，河东郡杨县（今山西省洪洞县）人。三国时期曹魏名将。早年跟随杨奉征战，并说服杨奉护送汉献帝东归洛阳，受封都亭侯。后来，归顺曹操，参与徐州之战、官渡之战、攻打冀州、白狼山之战、南郡之战、渭南之战 、凉州之战、汉中之战等重大战役，屡立功勋。"
        }, {
            "genre": "3",
            "no": "305",
            "name": "文丑",
            "name1": "未知",
            "doc": "文丑，东汉末年袁绍部将。为一夫之勇。建安五年（200年），带领左将军刘备进驻延津，误中曹操军师荀攸的“饵敌”之计，其麾下“五六千骑”惨败于“不满六百”的曹军骑兵。文丑本人也死于乱军之中，葬于河南省禹州市”。"
        }, {
            "genre": "3",
            "no": "306",
            "name": "颜良",
            "name1": "未知",
            "doc": "颜良 ，安平郡堂阳县（今河北省新河县）人。东汉末年袁绍部将。性格促狭，虽骁勇不可独任，为一夫之勇。官渡之战，袁绍令颜良进攻白马（今河南滑县）。司空曹操采用军师荀攸“声东击西、轻兵掩袭”之计 ，亲自率军兼行，击破颜良军。"
        }, {
            "genre": "3",
            "no": "307",
            "name": "太史慈",
            "name1": "字子义",
            "doc": "太史慈，字子义，东莱黄县（今山东龙口东黄城集）人。东汉末年名将，官至建昌都尉。弓马熟练，箭法精良。曾为救孔融而单骑突围向刘备求援。原为刘繇【yáo】部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。"
        }, {
            "genre": "3",
            "no": "308",
            "name": "甘宁",
            "name1": "字兴霸",
            "doc": "甘宁，字兴霸，巴郡临江（今重庆忠县）人  ，三国时期孙吴名将，官至西陵太守，折冲将军。少年时在地方上为非作歹，组成渠师抢夺船只财物，崇尚奢华，人称锦帆贼。青年时停止抢劫，熟读诸子。"
        }, {
            "genre": "3",
            "no": "309",
            "name": "张宝",
            "name1": "未知",
            "doc": "张宝，钜鹿（治今河北平乡）人，东汉末年黄巾起义首领之一，张角的弟弟，张梁的哥哥。中平元年（184）随兄张角起义，号称“地公将军”。后来张宝在曲阳（今河北晋州）被皇甫嵩、郭典击败，被杀。"
        }, {
            "genre": "4",
            "no": "400",
            "name": "张角",
            "name1": "未知",
            "doc": "张角，钜鹿（秦治今河北平乡、东汉治今河北宁晋）人。中国东汉末年农民起义军“黄巾军”的领袖。修太平道 ，利用其中的某些宗教观念和社会政治思想，组织群众，约于灵帝建宁（168年-172年）初传道。"
        }, {
            "genre": "4",
            "no": "401",
            "name": "鲁肃",
            "name1": "子敬",
            "doc": "鲁肃，字子敬，汉族，临淮郡东城县（今安徽省滁州市定远县人），东汉末年杰出战略家、外交家。"
        }, {
            "genre": "4",
            "no": "402",
            "name": "华雄",
            "name1": "未知",
            "doc": "华[huà]雄，中国东汉末年董卓部下的武将，为董卓帐下都督。公元191年，关东军阀联合讨伐董卓，董卓派大将胡轸统率华雄等进攻时任长沙太守的孙坚，结果被孙坚大败，华雄在此战中被孙坚枭首。"
        }, {
            "genre": "4",
            "no": "403",
            "name": "黄盖",
            "name1": "字公覆",
            "doc": "黄盖，字公覆，零陵泉陵（今湖南省永州市零陵区）人。东汉末年名将，历仕孙坚、孙策、孙权三任，为人严肃，善于训练士卒，每每征讨，他的部队皆勇猛善战。"
        }, {
            "genre": "4",
            "no": "404",
            "name": "张绣",
            "name1": "未知",
            "doc": "张绣，武威郡祖厉（今甘肃省靖远县）人也。骠骑将军张济的从子。东汉末年割据宛城的军阀，汉末群雄之一。曹魏时期，与段煨、贾诩、明元郭氏皇后是同乡，也是凉州豪族集团的代表人物。"
        }, {
            "genre": "4",
            "no": "405",
            "name": "周泰",
            "name1": "字幼平",
            "doc": "周泰，字幼平，九江下蔡（今安徽凤台）人。三国时期孙吴武将。孙策平定江东时与同郡蒋钦一起加入孙策军，随孙策左右，从征刘繇、严白虎、王朗等人，数有战功。后来，孙权爱其为人，向孙策请求让周泰跟随自己。"
        }, {
            "genre": "4",
            "no": "406",
            "name": "夏侯渊",
            "name1": "字妙才",
            "doc": "夏侯渊，字妙才，沛国谯县（今安徽亳州市谯城区）人。东汉末年名将，太仆夏侯婴后代。早年跟随曹操征伐四方，先后任骑都尉和陈留、颍川二郡太守。参加官渡之战，负责督运粮草。"
        }, {
            "genre": "4",
            "no": "407",
            "name": "马忠",
            "name1": "字德信",
            "doc": "马忠，本名狐笃，字德信。巴西阆中（今四川阆中）人。三国时期蜀汉将领。建安末年，马忠被推举为孝廉，任汉昌长。曾被刘备称为贤才。丞相诸葛亮开府治事，任马忠为门下督。建兴三年（225年），马忠出任牂牁郡太守，讨平牂牁叛乱。"
        }, {
            "genre": "4",
            "no": "408",
            "name": "韩忠",
            "name1": "未知",
            "doc": "南阳黄巾渠帅张曼成手下，张曼成被南阳太守秦颉击毙后，继续拥立赵弘为帅，但赵弘随即被朱儁再次剿灭。韩忠率领余部占据宛城（今河南南阳），与朱儁相持，后被朱儁击败而投降，但却被南阳太守秦颉所杀。"
        }, {
            "genre": "4",
            "no": "409",
            "name": "文虎",
            "name1": "未知",
            "doc": "文虎，谯郡谯县（今安徽亳州）人。魏末晋初将领，文稷之孙，文钦之子，文鸯之弟。毌丘俭发起叛乱时参战，兵败投奔吴国。诸葛诞发起叛乱时，与父兄一同率领吴军参战。当文钦向诸葛诞进谏言被斩后，和二兄文鸯一起跃过城墙，重新投回魏国。"
        }, {
            "genre": "5",
            "no": "500",
            "name": "小兵",
            "name1": "未知",
            "doc": "不详"
        }
    ]
}